app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @song = Song.new(artist_id: params[:artist_id])
    if params[:artist_id]
      if Artist.find_by(id: params[:artist_id]).nil?

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
---
  def edit
    @song = Song.find_by(id: params[:id])
    @artist = Artist.find_by(id: params[:artist_id])